#!/bin/bash

# получаем параметры
echo -e "\033[35m____________________________________________________________________ \n"
echo -e "\033[0m 1. Все записи, отсортированные по коду ответа 
 2. Все уникальные IP, встречающиеся в записях 
 3. Все запросы с ошибками (код ответа - 4хх или 5хх) 
 4. Все уникальные IP, которые встречаются среди ошибочных запросов"
echo -e "\033[35m____________________________________________________________________ \n"
echo -ne "\033[32mВыберите один параметр: \033[0m"
read PARAMETR

if [ $PARAMETR = "1" ]; then
    awk '{print}' ../04/nginx_log* | sort -nk9
elif [ $PARAMETR = "2" ]; then
    awk '{print $1}' ../04/nginx_log_* | sort -nu
elif [ $PARAMETR = "3" ]; then
    awk '/[45][0-9][0-9]/{print}' ../04/nginx_log_* | sort -n
elif [ $PARAMETR = "4" ]; then
    awk '/[45][0-9][0-9]/{print $1}' ../04/nginx_log_* | sort -n
else
    echo -e "\033[31mНеверно выбран параметр"
fi
